{
  "id": "timeline",
  "title": "Timeline.log",
  "icon": "",
  "content": {
    "experiences": [
      {
        "period": "Ene 2024 - Presente",
        "position": "Ecosistema de Trading Algor铆tmico",
        "company": "I+D Independiente",
        "description": "Dise帽o de una plataforma de trading, integrando datos de Coinglass mediante un scraper propietario, eliminando costos de API. Creaci贸n de un pipeline ETL a medida ('datasetcreator') para la generaci贸n de datasets de alta calidad para el fine-tuning de modelos de IA (R1). Implementaci贸n de una arquitectura de IA de dos niveles: un Orquestador (LLM grande) y un Especialista (modelo fine-tuneado) para optimizar costos y precisi贸n.",
        "technologies": ["Python", "FastAPI", "Web Scraping", "Fine-Tuning", "LLM", "ETL", "PostgreSQL", "Docker"]
      },
      {
        "period": "May 2025 - Jul 2025",
        "position": "Pivote Estrat茅gico: Sistema Ag茅ntico Legal",
        "company": "I+D Independiente",
        "description": "Realizaci贸n de un post-mortem estrat茅gico que concluy贸 que la barrera del TradingBot era el capital y la latencia. Re-capitalizaci贸n de la arquitectura de agentes y RAG para aplicarla al dominio de la IA Jur铆dica, un sector con barreras tecnol贸gicas m谩s accesibles. Demostraci贸n de madurez para reasignar recursos t茅cnicos hacia objetivos de mayor viabilidad.",
        "technologies": ["RAG", "Vector Databases", "ChromaDB", "Agentes de IA", "An谩lisis Estrat茅gico", "Python"]
      },
      {
        "period": "Continuo",
        "position": "Laboratorio de IA Local en RunPod",
        "company": "Infraestructura de Experimentaci贸n",
        "description": "Despliegue de un stack de IA en RunPod (NVIDIA 3090), dockerizado, como motor de I+D personal. Orquestaci贸n de m煤ltiples modelos en conjunto: un LLM destilado (R1), un modelo de embeddings (Qwen3) y un reranker (Qwen3). Uso de un chatbot local como banco de pruebas para validar arquitecturas y modelos antes del despliegue.",
        "technologies": ["RunPod", "NVIDIA 3090", "Docker", "LLM Destilado", "Embeddings", "Qwen3", "Model Orchestration"]
      },
      {
        "period": "Ago 2025",
        "position": "Despliegue en Cloud: 'RecApp' en Azure",
        "company": "Prueba de Concepto Enterprise",
        "description": "Desarrollo de un consultor de p贸lizas inteligente utilizando GPT-5-Mini en Azure. Dise帽o de un 'Router de Intenciones' para orquestar agentes de IA especializados, aplicando el rol de 'Orquestador de IA'.",
        "technologies": ["Microsoft Azure", "GPT-5-Mini", "Router de Intenciones", "Orquestaci贸n de Agentes", "Enterprise AI"]
      },
      {
        "period": "Sep 2023 - Feb 2024",
        "position": "Resiliencia en Producci贸n: 'Delibot'",
        "company": "Delify (Emprendimiento Propio)",
        "description": "Implementaci贸n de un manager de operaciones con IA en producci贸n, integrando WhatsApp, scraping en tiempo real y persistencia en Docker (PostgreSQL/ChromaDB). Resoluci贸n de errores en cascada mediante an谩lisis forense, culminando en una 'Arquitectura Tool-First' para eliminar alucinaciones del modelo.",
        "technologies": ["WhatsApp API", "Real-time Scraping", "PostgreSQL", "ChromaDB", "Docker", "Arquitectura Tool-First", "Production AI"]
      }
    ],
    "education": [
      {
        "period": "2019 - 2023",
        "degree": "Ingenier铆a en Sistemas",
        "institution": "Universidad Tecnol贸gica Nacional",
        "description": "Enfoque en arquitectura de sistemas, algoritmos y desarrollo de software. Especializaci贸n en inteligencia artificial y machine learning."
      }
    ]
  }
}